# TrussElementRotateChordsWithTruss Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussElementRotateChordsWithTruss Property
ParameterTypeId Class See Also
---
"Rotate Chords With Truss"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussElementRotateChordsWithTruss { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussElementRotateChordsWithTruss As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussElementRotateChordsWithTruss {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace